<!-- dflook/terraform-github-actions {"workspace":"github-dot-com-token","backend_type":"remote","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"797c8c11760b9fdab41b688c2d39bcd8286308de10ee431a88b2f470fe850477","plan_job_ref":"Job Test plan target and replace #420 at https://github.com/dflook/terraform-github-actions/actions/runs/8114469550","plan_hash":"8372a8187f19c847abf056ec666f39dc7557a9f4e973b8b0fd598dddf057278b","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__ in the __github-dot-com-token__ workspace
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
!~  count   = "6RYy8s605b" -> (known after apply)
!~  foreach = "x2PAkcD2fF" -> (known after apply)
```
</details>

:memo: Plan generated in [Test plan target and replace #420](https://github.com/dflook/terraform-github-actions/actions/runs/8114469550)